ti-cortex-m4/tm4c1294ncpdt/ek-tm4c1294xl/project1/src/hardware/watchdog.c
/*------------------------------------------------------------------------------
WATCHDOG.C


------------------------------------------------------------------------------*/

#include "../main.h"
#include "inc/hw_types.h"
#include "inc/hw_memmap.h"
#include "inc/hw_sysctl.h"
#include "inc/hw_ints.h"
#include "driverlib/watchdog.h"
#include "driverlib/interrupt.h"
#include "../memory/mem_program.h"
#include "watchdog.h"



#define WATCHDOG_LOAD   (ulong)(0x20000000)



void    InitWDT(void)
{
  if (boEnblWDT == true)
    EnableWDT();
}


void    EnableWDT(void)
{
#ifdef ENABLE_WATCHDOG

  HWREG(SYSCTL_RCGCWD) |= SYSCTL_RCGCWD_R0;

  WatchdogReloadSet(WATCHDOG0_BASE, WATCHDOG_LOAD);

  WatchdogEnable(WATCHDOG0_BASE);
  WatchdogResetEnable(WATCHDOG0_BASE);
//  IntEnable(INT_WATCHDOG_TM4C123);
  WatchdogStallEnable(WATCHDOG0_BASE);

#endif
}


void    DisableWDT(void)
{
#ifdef ENABLE_WATCHDOG

  HWREG(SYSCTL_RCGCWD) |= SYSCTL_RCGCWD_R0;

  WatchdogReloadSet(WATCHDOG0_BASE, WATCHDOG_LOAD);

//  WatchdogDisable(WATCHDOG0_BASE);
  WatchdogResetDisable(WATCHDOG0_BASE);
//  IntDisable(INT_WATCHDOG_TM4C123);
//  WatchdogStallEnable(WATCHDOG0_BASE);

#endif
}


void    ResetWDT(void)
{
#ifdef ENABLE_WATCHDOG

  WatchdogReloadSet(WATCHDOG0_BASE, WATCHDOG_LOAD);

#endif
}


bool    IsResetWDT(void)
{
  return false;
}



void    WatchdogIntHandler(void)
{
}
